#!/usr/bin/env python
# -*- coding: utf-8 -*-

import os


# BAD_WORDS = ("❌", "один сломали, другой потеряли", "не нашёл", "и мне бы хотелось, но нет")
BAD_WORDS = ("не нашёл", "и мне бы хотелось, но нет", "ищи пакет", "в ящиках с пакетами")

BAD_WORDS_ERROR = ("Воу, Воу! Полегче!", "Походу сервера легли!", "Или что-то случилось, или… одно из двух!")

ICONS = {
    "box": "📦",
    "remove": "🗑🟢🟩✅🤘✍️💥🔥🎖🏆🚀🛸💰💎🛒🎁🚮⏏️🚩",
}

RE_ITEM_FORMAT = r""

SEPARATORS = r" ,/;\|" + "\n"

SYNONYMS = {
    "cmd_add_place": (
        "add_place",
        "добавить_место",
        "добавь_место",
    ),
    "cmd_add_item": (
        "+",
        "add ",
        "добавить ",
        "добавь ",
    ),
    "cmd_del_item": (
        "-",
        "del ",
        "удалить ",
        "удали ",
    ),
    "cmd_csv": (
        "csv",
        "экспорт",
        "в файл",
    ),
    "cmd_roll": (
        "жребий ",
        "каменцы ",
        "судьбина ",
    ),
}

TOKEN = os.environ["TOKEN"]


# print(dir(__main__))
